//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Dr18_1.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm1 *Form1;
//---------------------------------------------------------------------------
__fastcall TForm1::TForm1(TComponent* Owner)
	: TForm(Owner)
{
}
//---------------------------------------------------------------------------
/*
 * -----------------------------
 *        バブル・ソート       *
 * -----------------------------
 */

#include "turboform.h"

#define N 6
void __fastcall TForm1::Button1Click(TObject *Sender)
{
    int a[]={80,41,35,90,40,20};
    int t,i,j;

    for (i=0;i<N-1;i++){
        for (j=N-1;j>i;j--){
            if (a[j]<a[j-1]){
                t=a[j];    a[j]=a[j-1]; a[j-1]=t;
            }
        }
    }

	tinit();cls();
    for (i=0;i<N;i++)
        printf("%d ",a[i]);
	printf("\n");
}
//---------------------------------------------------------------------------
