//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Dr20_3.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm1 *Form1;
//---------------------------------------------------------------------------
__fastcall TForm1::TForm1(TComponent* Owner)
	: TForm(Owner)
{
}
//---------------------------------------------------------------------------
/*
 * ---------------------
 *      基本挿入法     *
 * ---------------------
 */

#include "turboform.h"

#define N 100   /* データ数 */
void __fastcall TForm1::Button1Click(TObject *Sender)
{
    int a[N+1],i,j,t;

    for(i=1;i<=N;i++)        /* Ｎ個の乱数 */
        a[i]=rand();

    a[0]=-9999;              /* 番兵 */
    for (i=2;i<=N;i++){
        t=a[i];
        for (j=i-1;a[j]>t;j--)
            a[j+1]=a[j];
        a[j+1]=t;
    }

	tinit();cls();
    for (i=1;i<=N;i++)
        printf("%8d",a[i]);
	printf("\n");
}
//---------------------------------------------------------------------------
