//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Rei15.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm1 *Form1;
//---------------------------------------------------------------------------
__fastcall TForm1::TForm1(TComponent* Owner)
	: TForm(Owner)
{
}
//---------------------------------------------------------------------------
/*
 * ---------------------------------------------------
 *      連立方程式の解法（ガウス・ジョルダン法）     *
 * ---------------------------------------------------
 */

#include "turboform.h"

#define N 3     /* 元の数 */
void __fastcall TForm1::Button1Click(TObject *Sender)
{
    double a[N][N+1]={{2.0  ,3.0  ,1.0  ,4.0  },
                      {4.0  ,1.0  ,-3.0 ,-2.0 },
                      {-1.0 ,2.0  ,2.0  ,2.0  }};
    double p,d;
    int i,j,k;

    for (k=0;k<N;k++){
        p=a[k][k];                /* ピボット係数 */
        for (j=k;j<N+1;j++)       /* ピボット行をｐで割る */
            a[k][j]=a[k][j]/p;
        for (i=0;i<N;i++){        /* ピボット列の掃き出し */
            if (i!=k){
                d=a[i][k];
                for (j=k;j<N+1;j++)
                    a[i][j]=a[i][j]-d*a[k][j];
            }
        }
    }

	tinit();cls();
    for (k=0;k<N;k++)
        printf("x%d=%f\n",k+1,a[k][N]);
}
//---------------------------------------------------------------------------
