//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Dr15_2.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm1 *Form1;
//---------------------------------------------------------------------------
__fastcall TForm1::TForm1(TComponent* Owner)
	: TForm(Owner)
{
}
//---------------------------------------------------------------------------
/*
 * ---------------------------------------------
 *      連立方程式の解法（ガウスの消去法）     *
 * ---------------------------------------------
 */

#include "turboform.h"

#define N 3     /* 元の数 */
void __fastcall TForm1::Button1Click(TObject *Sender)
{
    double a[N][N+1]={{2.0  ,3.0  ,1.0  ,4.0  },
                      {4.0  ,1.0  ,-3.0 ,-2.0 },
                      {-1.0 ,2.0  ,2.0  ,2.0  }};
    double d;
    int i,j,k;

    for (k=0;k<N-1;k++){            /* 前進消去 */
        for (i=k+1;i<N;i++){
            d=a[i][k]/a[k][k];
            for (j=k+1;j<=N;j++)
                a[i][j]=a[i][j]-a[k][j]*d;
        }
    }
    for (i=N-1;i>=0;i--){            /* 後退代入 */
        d=a[i][N];
        for (j=i+1;j<N;j++)
            d=d-a[i][j]*a[j][N];
        a[i][N]=d/a[i][i];
    }

	tinit();cls();
    for (k=0;k<N;k++)
        printf("x%d=%f\n",k+1,a[k][N]);

}
//---------------------------------------------------------------------------
